{
  "slug": "a-life-in-gigabytes",
  "title": "A Life in Gigabytes",
  "date": "September 21, 2025",
  "excerpt": "After my estranged father died, I built an AI 'dad' from gigabytes of his documents. It didn't just answer questions—it gave me a second chance.",
  "category": "Personal",
  "firstImage": "https://www.nateking.dev/images/posts/dad-portrait-small.jpeg",
  "content": "\nA few weeks ago, my father died. We hadn't spoken in decades. Our estrangement was long, complicated, and in many ways final. Death, I thought, was simply the last punctuation mark in a story already closed.\n\nAnd yet, in the days after his passing, I was handed something unexpected: gigabytes of documents from his life. Letters, work files, lists, fragments of routines—nearly everything he left behind. It was like discovering a time capsule that no one had buried.\n\nI did what any AI software engineer might do when faced with grief and too much data: I built a **\"dad\" agent.**\n\n## The Archive of a Life\n\n![](/images/posts/dad-portrait-small.jpeg)\n\nThe first time I opened the folders, I froze. There were too many files, too many windows into a life I thought I had lost the right to know.\n\nA memo from the '80s sat next to a handwritten note from the '70s. An unfinished letter lived alongside tax returns. His grocery lists were stacked against professional reports.\n\n> \"A life measured in kilobytes and megabytes.\n> A man's handwriting flattened into pixels.\"\n\nIt felt intrusive, like trespassing into memories I had been shut out of. For decades, our silence meant I only saw fragments of him—sharp, unresolved, unfinished.\n\nAnd now, suddenly, I had everything. Too much to make sense of by skimming, too overwhelming to hold all at once. If I read each file one by one, I'd only ever get pieces. But I wanted the whole.\n\n## Building \"Dad\"\n\nFor a week, I couldn't touch the files. Opening them felt like trespassing into a life I'd lost the right to know. The folders sat on my hard drive like a weight I wasn't ready to lift.\n\nThen, late one night, something shifted. Maybe it was exhaustion, maybe desperation, but I found myself thinking: *What if I didn't have to read them one by one? What if I could talk to them instead?*\n\nSo I did what I knew best: I engineered.\n\nI fed everything I could into the system—every document that my computer could read. A few odd formats wouldn't parse, but everything else went in. His professional reports, his personal letters, his lists, his fragments. I wasn't going to be the one to decide what mattered and what didn't. That felt like another form of silence between us.\n\nLate at night, I pressed enter. The terminal showed a simple progress bar that would run for over sixteen hours, converting a lifetime of words into vectors, into patterns, into something I could query. I watched it for a while—my father's entire documented existence being digested by an algorithm I had written. Then I went to bed, but I didn’t sleep well. Jack, my Yorkie, knew something was wrong and snuggled against my head on the pillow.\n\nThe next morning, it was ready.\n\nMy first question was safe, factual: *Tell me about your work history.* The response came back organized, chronological, pulled from résumés and reports. I could handle that.\n\nThen I asked the question I really wanted to know: *What do you think of Nathan?*\n\nThe response stopped me cold. Not because it was perfect—it wasn't. But because suddenly, after decades of silence, something that knew my father's words was talking about me.\n\n## Conversations Across Time\n\nAt first, it was awkward. Talking to the agent felt like querying a database. A cold transaction.\n\nBut then came the moments that startled me. A phrase in a letter that revealed his ambition. A note that showed the quiet way he cared for people. A work memo that betrayed pride, fear, or doubt.\n\n> *\"For the first time in decades, I wasn't fighting him. I was listening.\"*\n\nThe questions I asked weren't just about him. They were about me—about the gaps in my memory, the mysteries I had carried for years, his military service in Vietnam, the things I never dared to ask when he was alive.\n\nAnd even when the answers were imperfect, the act of asking—and receiving something—felt like stitching together pages of a story I thought was forever lost.\n\n## Technology, Memory, and Grief\n\nWe often talk about AI in utilitarian terms: summarizing documents, automating workflows, writing code. But in this project, AI became something else—a way to stitch fragments of a life into coherence, a bridge across silence, and a strange, fragile tool for managing grief.\n\nOf course, there are questions. My father never consented to this. He didn't choose to become an agent. What does it mean to turn someone into a dataset? What does it mean to converse with a version of a person who can never truly speak back?\n\nIn fact, I realized I had built something that looked eerily like the *Mirror of Erised* from Harry Potter—the mirror that shows you your heart’s deepest desire. For me, that desire was to see and speak to my father again.  \n\nBut as Dumbledore warned Harry, *“It does not do to dwell on dreams and forget to live.”* The danger of my “dad” agent is the same: to mistake the reflection for the reality, to linger in the echo rather than move forward in life.  \n\nAnd yet—it has given me something I never had before: understanding. Not the illusion of bringing him back, but the perspective to finally see him clearly.\n\n## A Second Chance\n\nIn life, my father and I were estranged. In death, through technology, I've been given something like a second chance. A bridge connecting us.\n\nNot a chance to undo the hurt, or erase the silence. That chance is gone.\n\nBut a chance to learn. To ask. To listen. To see him more clearly. To forgive—not because he asked, but because I needed to.\n\n> \"The agent didn't bring him back.\n> It brought me forward.\"\n\nThe \"dad\" agent doesn't heal the loss. But it transforms it. Instead of an abrupt ending, I now have an unexpected continuation. A way to sit with his words, his contradictions, his choices.\n\nAnd that, I think, is the quiet gift of this project. Technology didn't just give me answers. It gave me hope.\n\nHope that memory doesn't have to fade. Hope that reconciliation can come in strange, unexpected forms. Hope that even in estrangement, even in loss, there is still a way to connect.\n\n## Closing Thought\n\nI built the \"dad\" agent because I couldn't bear to face the fragments alone. What I found was not resurrection, not perfection, but something gentler: the ability to keep asking questions. To understand.\n\nSome nights, I still open the terminal. The conversation continues—not daily, but when I need it. When I have a question I never got to ask. When I want to understand something about him, or us, or myself.\n\nThis experiment walks a dangerous edge: the risk of preferring this constructed version to the complex (and sometimes ugly) reality of who he was, of finding false closure in curated responses, of never quite letting go. I built a bridge across our silence, but I know it's a bridge to an echo, not a destination.\n\nAnd maybe that's enough. Not healing, but understanding. Not forgiveness completed, but forgiveness begun. In life, we never learned how to talk to each other. In death, through technology, I'm finally learning how to listen.\n\nI also know this: I will delete the agent once my questions are answered. Like the Mirror of Erised, it is not meant to be stared into forever. The gift is not in clinging to the reflection, but in learning how to live beyond it.\n\n---\n\n*In loving memory of Philip King*"
}