{
  "slug": "introducing-prose",
  "title": "Introducing Prose",
  "date": "September 9, 2025",
  "excerpt": "Frustrated with bloated Markdown editors, I built Prose—a clean, distraction-free writing app that respects focus, typography, and simplicity.",
  "categories": [
    "Writing",
    "Engineering"
  ],
  "firstImage": "https://www.nateking.dev/images/posts/prose-smallr.png",
  "content": "\n![Prose Logo](/images/posts/prose-smallr.png)\n\nI live in Markdown. Every blog post, every note, every README, every chapter of my novel—it all starts as plain text with simple formatting marks. After years of this workflow, I've developed strong opinions about how a Markdown editor should work. Apparently, *very* strong opinions.\n\nHalfway through writing my novel, I realized I was switching between editors throughout the day, each one frustrating me in different ways. One had beautiful typography but buried essential features in menus. Another handled Markdown perfectly but looked like it was designed in 2005. Some were bloated with features I'd never use, turning my simple writing environment into an interface that looked like it belonged in a NASA control center.\n\nThe more I wrote, the more these small frustrations compounded. I found myself spending more time fighting with my tools than actually writing. When you're trying to maintain flow state while crafting a narrative, even the smallest friction feels like sandpaper on your brain.\n\nSo I did what any self-respecting software engineer would do: I spent a weekend building exactly what I wanted.\n\n![](/images/posts/prose-main.png)\n\n**Prose** is a lightweight React app built for writers who love Markdown. It's not trying to be everything to everyone. It's trying to be one thing exceptionally well: a clean, fast, distraction-free environment for writing in Markdown.\n\nProse embodies my personal philosophy about writing tools:\n\n**Markdown formatting should be invisible when editing.** Formatting marks should be treated as plain text while editing. Visual simplicity is one of my favorite aspects of writing in plain text.\n\n**Text presentation matters.** Good typography isn't a luxury—it's essential for long writing sessions. Your eyes should feel comfortable after hours of work, and your writing should be presented in a visually appealing style. When reading, text should always be *fully justified.*\n\n**Lightweight doesn't mean featureless.** It means every feature earns its place. No bloat, no feature creep, just the tools you actually use while writing.\n\n**The UI should disappear.** When you're in flow, you shouldn't notice the interface at all. It should be so intuitive that it becomes invisible.\n\n## Who It's For\n\nProse is for writers who:\n- Default to Markdown for everything\n- Value simplicity over feature lists\n- Want their tools to respect their focus\n- Believe that good writing tools should inspire you to write, not distract you from it\n\nIt's the editor I wished existed when I was deep in Chapter 12, trying to maintain momentum while my current editor decided to auto-format my dialogue in ways that made me want to throw my laptop out the window.\n\n## What's Next\n\nProse is available as an open-source project. It's intentionally minimal, but that doesn't mean it's finished. I'm using it daily for my novel and all my other writing, constantly refining the experience based on use.\n\nSometimes the best tool is the one that knows when to get out of the way.\n\n---\n\n*Prose is available at [GitHub](https://github.com/nathan-a-king/Prose). Built with React, designed for writers, and maintained by someone who uses it every single day.*"
}